Reports/ЖурналПротоколовВК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ЖурналПротоколовВК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиалы</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ЖурналПротоколовВК/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
	Если ЗначениеЗаполнено(Отчет.Ответственный) Тогда
		Отчет.Должность = ПредставлениеДолжностиСотрудника(Отчет.Ответственный);
	КонецЕсли;
	
	Элементы.Филиалы.Видимость = ПараметрыСеанса.УчетПоНесколькимФилиалам;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
    Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
    Диалог.Период = Новый СтандартныйПериод(Отчет.ПериодНачало, Отчет.ПериодОкончание);        
    Если Диалог.Редактировать() Тогда
        Отчет.ПериодНачало = Диалог.Период.ДатаНачала;
        Отчет.ПериодОкончание = Диалог.Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Отчет.Ответственный) Тогда
		ДолжностьСотрудника = ПредставлениеДолжностиСотрудника(Отчет.Ответственный);
		Если ЗначениеЗаполнено(ДолжностьСотрудника) Тогда
			Отчет.Должность = ДолжностьСотрудника;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчет()
	
	Отчет.Филиалы = Филиалы;
	ТаблицаОтчета = РеквизитФормыВЗначение("Отчет").СформироватьОтчет();
	
КонецПроцедуры

&НаСервереБезконтекста
Функция ПредставлениеДолжностиСотрудника(Сотрудник)
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ДолжностьСотрудника = Сотрудник.Должность;
		Если ЗначениеЗаполнено(ДолжностьСотрудника) Тогда
			
			Возврат Строка(ДолжностьСотрудника);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти
